import * as React from "react"
import Svg, { Path } from "react-native-svg"

const PrevNext = ({ 
  fillColor = "#363636", 
  size = 26, 
  reverse = false, 
  ...props 
}) => (
  <Svg
    xmlns="http://www.w3.org/2000/svg"
    width={size}
    height={size}
    viewBox="0 0 26 26" // Фиксируем внутреннюю сетку
    fill="none"
    style={{
      // Если reverse=true, зеркально отражаем по горизонтали
      transform: [{ scaleX: reverse ? -1 : 1 }]
    }}
    {...props}
  >
    <Path
      fill={fillColor}
      d="M6.23 6.5a.813.813 0 0 0-1.626 0v13a.813.813 0 0 0 1.625 0v-13ZM16.778 5.703c-.733-.079-1.462.154-2.244.521-.778.366-1.731.925-2.934 1.632l-.075.044c-1.203.707-2.156 1.267-2.856 1.77-.704.506-1.263 1.03-1.559 1.707a4.054 4.054 0 0 0 0 3.246c.296.678.855 1.201 1.56 1.707.699.504 1.652 1.063 2.855 1.77l.075.044c1.203.707 2.156 1.267 2.934 1.632.782.367 1.511.6 2.244.521a3.937 3.937 0 0 0 2.784-1.633c.429-.6.594-1.351.672-2.222.079-.867.079-1.985.079-3.4v-.084c0-1.415 0-2.534-.079-3.4-.078-.871-.243-1.622-.672-2.222a3.938 3.938 0 0 0-2.784-1.633Z"
    />
  </Svg>
)

export default PrevNext